import streamlit as st
import pandas as pd
import numpy as np
import re
import google.generativeai as genai
import os
import json
import plotly.express as px

from pythainlp.tokenize import word_tokenize
import matplotlib.pyplot as plt
import pythainlp


#ตั้งค่า TITLE
st.title('🔮Tangdee ชื่อดี ชีวิตปัง')
st.caption('โปรแกรมให้คำแนะนำในการตั้งชื่อและเปลี่ยนชื่อ และทำนายดวงชะตาจากชื่อของคุณ โดยใช้ตำราทักษา ตำราโหราศาสตร์ด้านการตั้งชื่อที่เก่าแก่ที่สุดของไทย By กวินนา บุญทศ')


#Authenticate with the API key from an environment variable
api_key = "AIzaSyCS4PK8ktnz9dRztfY5bBSjGmkbxRDk7IY"
if not api_key:
    raise ValueError("API key not found. Please set the GOOGLE_API_KEY environment variable.")

# Configure the genai library with your API key
genai.configure(api_key=api_key)

#Select the model
# The "gemini-2.5-flash" model is a great, fast, and cost-effective choice.
#model = genai.GenerativeModel("gemini-2.5-flash-lite")
model = genai.GenerativeModel("gemini-2.5-flash-lite",generation_config={"response_mime_type": "application/json"})

#รับ INPUT เป็นชื่อจริง
name_input = st.text_input('กรุณาใส่ ชื่อจริง ของท่านเป็นภาษาไทย เช่น กวินนา')
thai_pattern = r"^[\u0E00-\u0E7F]{2,}$"


day_input = st.selectbox("กรุณาเลือกวันเกิดของท่าน",["อาทิตย์","จันทร์","อังคาร","พุธกลางวัน","พุธกลางคืน","พฤหัสบดี","ศุกร์","เสาร์"])
gender_input = st.radio("กรุณาระบุเพศของท่าน",["ชาย", "หญิง"])
mean_input = st.text_input('กรุณาใส่ความหมายของชื่อที่ต้องการ(อย่างน้อย 20 ตัวอักษร)')
syllable_input = st.number_input('ความยาวของพยางค์ที่ต้องการประมาณ(หมายเหตุ: ชื่อที่ออกมาอาจมากหรือน้อยกว่าจำนวนที่กำหนดเล็กน้อย เพราะหลายปัจจัย เช่น การสะกด การสร้างคำ)',min_value=1,max_value=10,step=1)
show_btn = st.button('Run!')


def Classification_Name(name_input,day_input):     
    kalakinee_patt = {"อาทิตย์": r"[ศษสหฬฮ]+","จันทร์": r"[อะัาำิีึืุูเแโใไ]+","อังคาร": r"[กขคฆง]+","พุธกลางวัน": r"[จฉชซฌญ]+","พุธกลางคืน": r"[บปผฝพฟภม]+","พฤหัสบดี": r"[ดตถทธน]+","ศุกร์": r"[ยรลว]+","เสาร์": r"[ฎฏฐฑฒณ]+"}
    pattern = kalakinee_patt.get(day_input, "")
    result = f'เป็นชื่อที่เป็นมงคลต่อชีวิต ตามวันเกิดของท่าน คือ วัน{day_input}'
    if re.findall(pattern, name_input):
        alpha_kalakinee = re.findall(pattern, name_input)
        result = f"เป็นชื่อที่มีตัวอักษรกาลกิณี คือ {alpha_kalakinee} ตามวันเกิดของท่าน คือ วัน{day_input}"
    else:
        result = result
    return result
def creat_df(gender_input, day_input, mean_input, syllable_input):
    kalakinee_patt = {
    "อาทิตย์": r"[ศษสหฬฮ]+",
    "จันทร์": r"[อะัาำิีึืุูเแโใไ]+",
    "อังคาร": r"[กขคฆง]+",
    "พุธกลางวัน": r"[จฉชซฌญ]+",
    "พุธกลางคืน": r"[บปผฝพฟภม]+",
    "พฤหัสบดี": r"[ดตถทธน]+",
    "ศุกร์": r"[ยรลว]+",
    "เสาร์": r"[ฎฏฐฑฒณ]+"}
    #ตัวอักษรกาลกิณีตามวันเกิด
    pattern = kalakinee_patt.get(day_input, "")

    # clean ข้อมูลความหมาย
    tokens = pythainlp.word_tokenize(mean_input)
    tokens_no_stop_words = []
    stopset = set(pythainlp.corpus.thai_stopwords())

    for t in tokens:
        if t not in stopset:
            tokens_no_stop_words.append(t)



    prompt = f"""
    เพศ: {gender_input}
    วันเกิด: {day_input}
    ความหมายของชื่อ:{tokens_no_stop_words}
    ตัวอักษรที่ห้ามมีในชื่อจริง: {pattern}
    ข้อกำหนดจำนวนพยางค์: {syllable_input}
    ความหมายของชื่อตาม: {tokens_no_stop_words}
    คุณคือหมอดูนักโหราศาสตร์ผู้เชี่ยวชาญด้านการตั้งชื่อภาษาไทยตามตำราทักษา 
    ฉันต้องการให้คุณสร้างชื่อจริงภาษาไทย(thai name) จำนวน 30 ชื่อ โดยที่ทั้ง 30 ชื่อห้ามเป็นชื่อที่ซ้ำกันเด็ดขาด ชื่อแต่ละชื่อต้องเป็นชื่อที่แตกต่างกัน ถ้าชื่อซ้ำกันห้ามใส่มาและต้องสร้างชื่อที่มีความหมายตาม {tokens_no_stop_words} และชื่อห้ามมีตัวอักษรใน {pattern} อยู่ในชื่อจริงเด็ดขาด 
    **ข้อห้ามที่สำคัญที่สุด (ห้ามฝ่าฝืนเด็ดขาด):**
    ถ้าค่าวันเกิด {day_input} == 'จันทร์' ชื่อจริงที่สร้างจะต้องไม่มีรูปสระปรากฎอยู่ในชื่อเลย เช่น อะ อา อิ อี อุ อู เอ แอ โอ ไอ ใอ อือ อำ เอา เอะ เอาะ แอะ อึ ออ เอือ อัว เอีย ไม้หันอากาศ ฯลฯ) ตัวอย่างชื่อที่ใช้ได้ ตัวอย่างชื่อ เช่น ใช้ได้:'กชกร' 'กนกพร' 'กฤษณ์' 'อรรณพ', ชื่อที่ห้ามใส่มา เช่น 'ไอรดา' 'กวินนา' 'เพทาย' 'อชิรกรณ์' เพราะมีสระอยู่ในชื่อจึงใช้ไม่ได้ห้ามตั้งแบบนี้
    ถ้าค่าวันเกิด {day_input} == 'อังคาร' ชื่อจริงที่สร้างจะต้องไม่มีตัวอักษรต้องห้ามของวันอังคาร คือ 'ก' 'ข' 'ค' 'ฆ' 'ง' อยู่ในชื่อจริงเลยแม้แต่ตัวเดียวก็ไม่ได้ ตัวอย่างชื่อ เช่น ชื่อที่ใช้ได้: 'อรนรี' 'ภาวดี' 'ธัชชัย' ,ชื่อที่ห้ามใส่มา เช่น  'ศิริกัลยา' 'อรอนงค์' 'ณัฐกิตติ์' ใช้ไม่ได้เพราะมีตัวอักษรต้องห้ามของวันอังคาร
    ถ้าค่าวันเกิด {day_input} == 'พุธกลางวัน' ชื่อจริงที่สร้างจะต้องไม่มีตัวอักษรต้องห้ามของวันพุธกลางวัน คือ 'จ' 'ฉ' 'ช' 'ซ' 'ฌ' 'ญ' อยู่ในชื่อจริงเลยแม้แต่ตัวเดียวก็ไม่ได้ ตัวอย่างชื่อ เช่น ชื่อที่ใช้ได้: 'แก้วพรรณลดา''ตรีอัปสร' 'วาสุเทพ' 'ปกรณ์',ชื่อที่ห้ามใส่มา เช่น 'นวลฉวี' 'เบญจวรรณ' 'ชุติวัฒน์' 'จุมพล' ใช้ไม่ได้เพราะมีตัวอักษรต้องห้ามของวันพุธกลางวัน
    ถ้าค่าวันเกิด {day_input} == 'พุธกลางคืน' ชื่อจริงที่สร้างจะต้องไม่มีตัวอักษรต้องห้ามของวันพุธกลางคืน คือ 'บ' 'ป' 'ผ' 'ฝ' 'พ' 'ฟ' 'ภ' 'ม' อยู่ในชื่อจริงเลยแม้แต่ตัวเดียวก็ไม่ได้ ตัวอย่างชื่อ เช่น ชื่อที่ห้ามใส่มา: 'กนกวรรณ' 'กัญญารัตน์' 'ธีรกิต' 'ณเดชน์',ชื่อที่ใช้ไม่ได้ เช่น 'ภีมะ' 'ปองกูล' 'บุปผา' 'วิมาลา' ใช้ไม่ได้เพราะมีตัวอักษรต้องห้ามของวันพุธกลางคืน
    ถ้าค่าวันเกิด {day_input} == 'พฤหัสบดี' ชื่อจริงที่สร้างจะต้องไม่มีตัวอักษรต้องห้ามของวันพฤหัส คือ 'ด' 'ต' 'ถ' 'ท' 'ธ' 'น' อยู่ในชื่อจริงเลยแม้แต่ตัวเดียวก็ไม่ได้ ตัวอย่างชื่อ เช่น ชื่อที่ใช้ได้: 'สาวิกา' 'อาโป' 'วีรกิจ' 'วสุพล',ชื่อที่ห้ามใส่มา เช่น 'ธาราทิพย์' 'ราตรีทัศน์' 'ธนา' 'ภูธัชชัย' ใช้ไม่ได้เพราะมีตัวอักษรต้องห้ามของวันพฤหัส
    ถ้าค่าวันเกิด {day_input} == 'ศุกร์' ชื่อจริงที่สร้างจะต้องไม่มีตัวอักษรต้องห้ามของวันศุกร์ คือ 'ย' 'ร' 'ล' 'ว' อยู่ในชื่อจริงเลยแม้แต่ตัวเดียวก็ไม่ได้ ตัวอย่างชื่อ เช่น ชื่อที่ใช้ได้: 'พิมมาดา' 'อาโป' 'แทนไท' 'ทัตพงศ์' ,ชื่อที่ห้ามใส่มา เช่น 'รภัสลดา' 'ดวงยิหวา' 'ธีรเดช' 'ภูวินทร์' ใช้ไม่ได้เพราะมีตัวอักษรต้องห้ามของวันศุกร์
    ถ้าค่าวันเกิด {day_input} == 'เสาร์' ชื่อจริงที่สร้างจะต้องไม่มีตัวอักษรต้องห้ามของวันเสาร์ คือ 'ฎ' 'ฏ' 'ฐ' 'ฑ' 'ฒ' 'ณ' อยู่ในชื่อจริงเลยแม้แต่ตัวเดียวก็ไม่ได้ ตัวอย่างชื่อ เช่น ชื่อที่ใช้ได้: 'พิมพิลาไลย' 'ปาริตา' 'ธนดล' 'ธนธร' ,ชื่อที่ห้ามใส่มา เช่น 'จุฑาวุฒิ' 'จุฬาลักษณ์' 'พิมลวรรณ' 'ธีรวุฒิ' ใช้ไม่ได้เพราะมีตัวอักษรต้องห้ามของวันเสาร์
    ถ้าค่าวันเกิด {day_input} == 'อาทิตย์' ชื่อจริงที่สร้างจะต้องไม่มีตัวอักษรต้องห้ามของวันอาทิตย์ คือ 'ศ' 'ษ' 'ส' 'ห' 'ฬ' 'ฮ' อยู่ในชื่อจริงเลยแม้แต่ตัวเดียวก็ไม่ได้ ตัวอย่างชื่อ เช่น ชื่อที่ใช้ได้: 'กติยา' 'ปานวาด' 'ปานเทพ' 'ยุทธนา',ชื่อที่ห้ามใส่มา เช่น 'นิสามณี' 'เมษา' 'นทีพิทักษ์' 'สิงห์' ใช้ไม่ได้เพราะมีตัวอักษรต้องห้ามของวันอาทิตย์
    และต้องสร้างความหมายของชื่อด้วย โดยการให้ความหมายของชื่อต้องมีความยาวอย่างน้อย 15 คำ
    สำหรับชื่อจริงที่สร้างต้องสอดคล้องกับเพศ: {gender_input} หากเป็นเพศชายต้องตั้งชื่อจริงที่เป็นที่นิยมตั้งในเพศชาย เช่น อัครเดช มาวินทร์ ธนภพ ก้องเกียรติ
    หากเป็นเพศหญิงต้องเป็นชื่อจริงที่นิยมตั้งในเพศหญิง เช่น วริศรา หริญรัญชนา ลลิษา จันทร์เจ้าขา นภาพร
    ชื่อที่ตั้งต้องมีจำนวนพยางค์ไม่เกิน {syllable_input} พยางค์
    ต้องเป็นชื่อจริงภาษาไทยที่มีความไพเราะด้านเสียง มีความหมายที่ดี และเป็นชื่อที่ใช้ได้จริง
    ให้ตอบกลับเป็น JSON *ล้วน ๆ* ตามโครงสร้างนี้ 
    ตัวอย่าง JSON:
    [
      {{
        "ชื่อ": "",
        "ความหมาย": "",
        "ระดับความหายากของชื่อ": "ทั่วไป / ปานกลาง / หายาก"
      }}
    ]
    ห้ามมีข้อความใด ๆ ก่อนหรือหลังโครงสร้าง JSON เด็ดขาด ห้ามส่งอะไรนอกเหนือจาก JSON
    """
    
    def calculate_score_of_name(name_list):
        thai_power_alpha = {"อ": 6, "ๅ": 6, "า": 6, "ะ": 6, "เ": 6, "ู": 6, "ุ" : 6,
                        "โ": 6,"ก": 15, "ข": 15, "ค": 15, "ฆ": 15, "ง": 15,
                        "จ": 8, "ฉ": 8, "ช": 8, "ซ": 8, "ฌ": 8, "ญ": 8,
                        "ฎ": 17, "ฏ": 17, "ฐ": 17, "ฑ": 17, "ฒ": 17, "ณ": 17,
                        "บ": 19, "ป": 19, "ผ": 19, "ฝ": 19, "พ": 19, "ฟ": 19, "ภ": 19, "ม": 19,
                        "ศ": 21, "ษ": 21, "ส": 21, "ห": 21, "ฬ": 21, "ฮ": 21,
                        "ด": 10, "ต": 10, "ถ": 10, "ท": 10, "ธ": 10, "น": 10,
                        "ย": 12, "ร": 12, "ล": 12, "ว": 12 }  
    #แยกตัวอักษร
        tuple_name = tuple(name_list) 
        tuple_score = ()
        for name in tuple_name: 
            score = 0
            for char in name:
                
                if char in thai_power_alpha:
                    score += thai_power_alpha[char]
                if char not in thai_power_alpha:
                    score += 0
            tuple_score = tuple_score + (score,)
   
        sum_power_score = ()
        for num in tuple_score:
            scores = 0
            str_num = str(num)
            for i in str_num:
                scores += int(i)
            sum_power_score = sum_power_score + (scores,)

        num1 = 'หากผลรวมค่าพลังอายตนะ คือ 1 ท่านเป็นผู้ที่มีชะตาชีวิตกล้าแกร่งเข้มแข็งร้อนแรง มีอำนาจวาสนามีบารมีดีมีจิตใจดีเป็นผู้นำครอบครัวที่ดีและเป็นที่ เคารพนับถือของคนทั่วไปผู้ใดได้คบหาใกล้ชิดด้วยก็รู้สึกอบอุ่นใจสบายใจ'
        num2 = 'หากผลรวมค่าพลังอายตนะ คือ 2 ชะตาชีวิตสูงส่งมีจิตใจอ่อนโยนมีมนุษยสัมพันธ์ดี มีความสง่างาม ใครได้อยู่ใกล้หรือคบหาด้วยก็มีความสุข จะไปอยู่ที่แห่งใด ก็มีผู้คนผูกพันรักใคร่และคิดถึงตลอด'
        num3 = 'หากผลรวมค่าพลังอายตนะ คือ 3 มักเหนื่อย เปรียบดังคนรับใช้ต้องให้บริการคนอื่นเสมอ เป็นคนสันโดษ กินน้อยใช้น้อย'
        num4 = 'หากผลรวมค่าพลังอายตนะ คือ 4 จิตใจไม่ค่อยสงบไม่ค่อยมีความเชื่อมั่นตัวเองขี้หลงขี้ลืมมักชอบน้อยใจไม่ค่อยสดชื่นแจ่มใส'
        num5 = 'หากผลรวมค่าพลังอายตนะ คือ 5 เป็นคนเชื่อมั่นในตัวเองสูงเกินไปมักดุร้ายหรือเจ้าอารมณ์เสมอ'
        num6 = 'หากผลรวมค่าพลังอายตนะ คือ 6 ชะตาชีวิตสูงส่งมีคนอุปถัมภ์ดีมั่นคงด้วยยศศักดิ์มีเสน่ห์และสง่างามเป็นที่รักใคร่นิยมชมชอบของคนทั่วไปใครๆก็อยากอยู่ใกล้ชิดมีความสุขกายสุขใจชีวิตมีความอุดมสมบูรณ์พูนสุข'
        num7 = 'หากผลรวมค่าพลังอายตนะ คือ 7 มีทรัพย์สินมากมีอํานาจบารมีดีเป็นที่รักใคร่นับถือของคนทั่วไปแต่มักเหนื่อยกับการพูดสักหน่อย'
        num8 = 'หากผลรวมค่าพลังอายตนะ คือ 8 มีโชคลาภวาสนามีบารมีดีได้เป็นผู้นําคนเป็นที่เคารพนับถือและเป็นที่ยำเกรงชีวิตมีความสุขกายสุขใจดี'
        num9 = 'หากผลรวมค่าพลังอายตนะ คือ 9 ขึ้นไป มีอํานาจวาสนาบารมีดีเปรียบดังเป็นราชาจะให้ความคุ้มครองป้องกันภัยแก่บุคคลในครอบครัวและผู้ที่ อยู่ใกล้ชิด ได้รับความเคารพและยําเกรง ชีวิตจะประสบความสําเร็จเป็นอย่างดี'

        tuple_predict = ()
        for n in sum_power_score:
            if n == 1:
                tuple_predict = tuple_predict + (num1,)
            elif n == 2:
                tuple_predict = tuple_predict + (num2,)
            elif n == 3:
                tuple_predict = tuple_predict + (num3,)
            elif n == 4:
                tuple_predict = tuple_predict + (num4,)
            elif n == 5:
                tuple_predict = tuple_predict + (num5,)
            elif n == 6:
                tuple_predict = tuple_predict + (num6,)
            elif n == 7:
                tuple_predict = tuple_predict + (num7,)
            elif n == 8:
                tuple_predict = tuple_predict + (num8,)
            else:
                tuple_predict = tuple_predict + (num9,)
        df_of_score = pd.DataFrame({"ชื่อ": name_list,"คะแนนตัวอักษร": tuple_score,"คำทำนาย": tuple_predict})
        return df_of_score


    try:
        response = model.generate_content(prompt)
        data = json.loads(response.text)
        #แปลงเป็น DataFrame
        df1 = pd.DataFrame(data)
        df_valid = pd.DataFrame([row for _, row in df1.iterrows() if not re.search(pattern, row['ชื่อ'])])
        #เอาชื่อซ้ำออก
        df_valid = df_valid.drop_duplicates(subset=['ชื่อ'])
        #ตรวจสอบว่าครบ 20 ชื่อหรือยัง
        while len(df_valid) < 20:
                response_2 = model.generate_content(prompt)
                data2 = json.loads(response_2.text)
                df2 = pd.DataFrame(data2)
                df2_valid = pd.DataFrame([row for _, row in df2.iterrows() if not re.search(pattern, row['ชื่อ'])])
                df2_valid = df2_valid.drop_duplicates(subset=['ชื่อ'])
                df2_only = df2_valid[~df2_valid['ชื่อ'].isin(df_valid['ชื่อ'])]
                df_valid = pd.concat([df_valid, df2_only], ignore_index=True)
        df_valid = df_valid.head(20)
        name_list = df_valid['ชื่อ'].tolist()
        score_n =  calculate_score_of_name(name_list)
        df_and_score = df_valid.merge(score_n, on = 'ชื่อ', how="left")
        return df_and_score
    
    except Exception as e:
        st.error(f"เกิดข้อผิดพลาด: {e}")
        return None

def convert_df_to_csv(df):
    # ฟังก์ชันสำหรับแปลง DataFrame เป็น CSV (ใช้ utf-8-sig เพื่อรองรับภาษาไทยใน Excel)
    return df.to_csv(index=False, encoding='utf-8-sig') 


if show_btn:
 
    st.markdown(f'✨ท่านมีชื่อว่า {name_input}')
    st.markdown(Classification_Name(name_input, day_input))
    st.markdown('📝หากท่านต้องการเปลี่ยนชื่อ ขอแนะนำชื่อที่เป็นมงคลตามวันเกิดของท่านดังนี้')
    st.markdown('⏳⏳⏳รอสักครู่ การรันโปรแกรมอาจใช้เวลาสักพัก⏳⏳⏳')
   
    result_df = creat_df(gender_input, day_input, mean_input,syllable_input)
    if not isinstance(result_df, pd.DataFrame):
        try:
        # ถ้าเป็น dict หรือ list ของ dict → แปลงได้
            result_df = pd.DataFrame(result_df)
        except Exception:
        # ถ้าแปลงไม่ได้จริง ๆ → สร้าง DataFrame ว่างเพื่อกัน error
            result_df = pd.DataFrame()
    
    st.subheader("👑ชื่อมงคล 20 ชื่อ)")
    st.dataframe(result_df, use_container_width=True)
    if result_df is not None and not result_df.empty:
    # 💡 ตรวจสอบว่าคอลัมน์ 'ชื่อ' มีอยู่จริง
        if 'ชื่อ' in result_df.columns:
            fig = px.bar(
                data_frame=result_df,
                x='ชื่อ',
                y='คะแนนตัวอักษร',
                title='คะแนนตัวอักษรของรายชื่อที่ระบบแนะนำ',
                labels={'ชื่อ': 'ชื่อ', 'คะแนนตัวอักษร': 'คะแนน'},
            )
    # แสดงกราฟใน Streamlit
            st.plotly_chart(fig, use_container_width=True)
    
    
    st.subheader("🏆 3 ชื่อที่ดีที่สุด (ตามคะแนนตัวอักษร)")
    top3 = result_df.nlargest(3, 'คะแนนตัวอักษร')   # เลือก 3 ตัวที่คะแนนสูงสุด
    st.dataframe(top3[['ชื่อ', 'ความหมาย','คะแนนตัวอักษร']],use_container_width=True, hide_index=True)
   
   
    st.subheader("⬇️ ดาวน์โหลดรายชื่อที่แนะนำ")
    # แปลง DataFrame ให้เป็น CSV string
    csv_file = convert_df_to_csv(result_df)
    
    # สร้างปุ่มดาวน์โหลด
    st.download_button(
        label="📥 ดาวน์โหลดชื่อมงคลเป็นไฟล์ CSV",
        data=csv_file,
        file_name='Tangdee_Names_Recommendations.csv',
        mime='text/csv',
    )

